---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemParamBoringout
source: html/a256ebdc-5b2f-5762-a061-9448113bec20.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemParamBoringout Property

"Boring out"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemParamBoringout { get; }
```